# Задаємо значення для першої та другої змінних
перша_змінна = float(input("Введіть значення для першої змінної: "))
друга_змінна = float(input("Введіть значення для другої змінної: "))

# Перевірка умови та виконання відповідних операцій
if перша_змінна > друга_змінна:
    третя_змінна = перша_змінна - друга_змінна
elif перша_змінна < друга_змінна:
    третя_змінна = перша_змінна + друга_змінна
else:
    третя_змінна = перша_змінна

# Виведення значення третьої змінної на екран
print(f"Значення третьої змінної: {третя_змінна}")
